/* 
 * File:   timer.c
 */

#include "FreeRTOS.h"
#include "commdef.h"

/* --------------------- スタティック変数定義 ------------------------- */
static TIMER_t time; /* タイマカウント */

/* ----------------------- プロトタイプ宣言 --------------------------- */
static void _TimerCount(void);


//******************************************************************************************
//   Function Name : vApplicationTickHook
//   Title         : OS Tick タイマコールバック関数 
//                   OS の Tick タイマ割り込み発生時に呼び出される
//                   1msec タイマとして使用 
//   Input         : 無し
//   Output        : 無し
//******************************************************************************************
void vApplicationTickHook(void)
{
    if(time.state!= 0)
    {/* タイマが有効 */
        /* タイマカウント処理 */
        _TimerCount();
    }
}

//******************************************************************************************
//   Function Name : TimerClear 
//   Title         : タイマカウンタをクリアする 
//   Input         : 無し 
//   Output        : 無し 
//******************************************************************************************
void TimerClear(void)
{
    /* カウンタのクリア */
    time.msec = 0;
    time.sec = 0;
    time.min = 0;
}

//******************************************************************************************
//   Function Name : TimerStart 
//   Title         : タイマカウント開始 
//   Input         : 無し 
//   Output        : 無し 
//******************************************************************************************
void TimerStart(void)
{
    /* カウンタのクリア */
    TimerClear();
    /* タイマ有効 */
    time.state = 1;
}

//******************************************************************************************
//   Function Name : TimerStop 
//   Title         : タイマカウント停止 
//   Input         : 無し 
//   Output        : 無し 
//******************************************************************************************
void TimerStop(void)
{
    /* タイマ無効 */
    time.state = 0;
}

//******************************************************************************************
//   Function Name : TimerChkMin
//   Title         : 経過時間の確認（分単位）
//   Input         : min : 問合せ時間（分）
//   Output        : TRUE : 経過している
//                   FALSE : 経過していない
//******************************************************************************************
int TimerChkMin(int min)
{
    if(time.min >= min)
    {/* タイマカウンタが問合せ時間以上 */
        /* 経過している */
        return TRUE;
    }
    else
    {/* タイマカウンタが問合せ時間未満 */
        /* 経過していない */
        return FALSE;
    }
}

//******************************************************************************************
//   Function Name : _TimerCount 
//   Title         : タイマカウントをインクリメント 
//   Input         : 無し 
//   Output        : 無し 
//******************************************************************************************
static void _TimerCount(void)
{
    /* ミリ秒カウンタをインクリメント */
    time.msec++;
    
    if(time.msec >= 1000)
    {/* 1秒経過 */
        /* 秒カウンタをインクリメント */
        time.sec++;
        /* ミリ秒カウンタをクリア */
        time.msec = 0;
    }
    
    if(time.sec >= 60)
    {/* 1分経過 */
        /* 分カウンタをインクリメント */
        time.min++;
        /* 秒カウンタをクリア */
        time.sec = 0;
    }
    
    if(time.min >= 1000)
    {/* 1000 分経過 */
        /* 回り込み防止のため 1000 分以上はカウントしない */
        time.min = 1000;
    }
}
